#### Import արեք pandas գրադարանը pd  անունով

In [1]:
# TODO
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [3]:
# TODO
baby_names = pd.read_csv('baby_names.csv')
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [6]:
# TODO
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [8]:
# TODO
baby_names.drop(['Unnamed: 0', 'Id'],axis=1, inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [9]:
# TODO
baby_names['Gender'].value_counts()

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [10]:
# TODO
names = baby_names.drop(['Year'],axis=1)
names.head()

      Name Gender State  Count
0     Emma      F    AK     62
1  Madison      F    AK     48
2   Hannah      F    AK     46
3    Grace      F    AK     44
4    Emily      F    AK     41

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [11]:
# TODO
names.nunique()

Name      575
Gender      2
State       1
Count      57
dtype: int64

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [12]:
# TODO
names['Name'].mode()

0    Riley
dtype: object

In [14]:
names['Name'].value_counts().head()

Riley       12
Molly       11
Nevaeh      11
Madison     11
Isabelle    11
Name: Name, dtype: int64

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [15]:
# TODO
names['Name'].value_counts().median()

3.0

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [16]:
# TODO
names.describe()

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000

In [17]:
names.describe(include="all")

         Name Gender State        Count
count    2503   2503  2503  2503.000000
unique    575      2     1          NaN
top     Riley      F    AK          NaN
freq       12   2404  2503          NaN
mean      NaN    NaN   NaN    11.485018
std       NaN    NaN   NaN     8.830294
min       NaN    NaN   NaN     5.000000
25%       NaN    NaN   NaN     6.000000
50%       NaN    NaN   NaN     8.000000
75%       NaN    NaN   NaN    13.000000
max       NaN    NaN   NaN    65.000000